ClusterM/famicom-dumper-writer/STM32_bootloader/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MSD_ADDRESS 0x8010000
#define MSD_BLOCK_SIZE 2048
#define MSD_BLOCK_COUNT 192 * 1024 / MSD_BLOCK_SIZE
#define M2_Pin GPIO_PIN_0
#define M2_GPIO_Port GPIOA
#define WS2812_Pin GPIO_PIN_2
#define WS2812_GPIO_Port GPIOA
#define NOE_Pin GPIO_PIN_4
#define NOE_GPIO_Port GPIOD
#define NWE_Pin GPIO_PIN_5
#define NWE_GPIO_Port GPIOD
#define NE1_Pin GPIO_PIN_7
#define NE1_GPIO_Port GPIOD
#define NE2_Pin GPIO_PIN_9
#define NE2_GPIO_Port GPIOG
#define IRQ_Pin GPIO_PIN_7
#define IRQ_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */
#define APP_ADDRESS 0x08040000
#define WRITE_TO_FLASH_TIME 1500
#define FIRMWARE_FILE "FamicomDumper.bin"
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
